Revit 2024 API
ContourSettingItem Class
 Contour setting item that stores the information of a single contour or a set of contours.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class ContourSettingItem : IDisposable
Visual Basic
Public Class ContourSettingItem _
	Implements IDisposable
Visual C++
public ref class ContourSettingItem : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ContourSettingItem
See Also
ContourSettingItem Members
Autodesk.Revit.DB Namespace